In [44]:
import pandas as pd
import numpy as np

In [9]:
data =pd.read_csv('../../data/beauty.csv', sep=';')
type(data)
data.head()

    wage  exper  union  goodhlth  black  female  married  service  educ  looks
0   5.73     30      0         1      0       1        1        1    14      4
1   4.28     28      0         1      0       1        1        0    12      3
2   7.96     35      0         1      0       1        0        0    10      4
3  11.57     38      0         1      0       0        1        1    16      3
4  11.42     27      0         1      0       0        1        0    16      3

In [13]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1260 entries, 0 to 1259
Data columns (total 10 columns):
wage        1260 non-null float64
exper       1260 non-null int64
union       1260 non-null int64
goodhlth    1260 non-null int64
black       1260 non-null int64
female      1260 non-null int64
married     1260 non-null int64
service     1260 non-null int64
educ        1260 non-null int64
looks       1260 non-null int64
dtypes: float64(1), int64(9)
memory usage: 98.5 KB

In [14]:
data.describe()

,wage,exper,union,goodhlth,black,female,married,service,educ,looks
count,1260.000000,1260.000000,1260.000000,1260.000000,1260.000000,1260.000000,1260.000000,1260.000000,1260.000000,1260.000000
mean,6.306690,18.206349,0.272222,0.933333,0.073810,0.346032,0.691270,0.273810,12.563492,3.185714
std,4.660639,11.963485,0.445280,0.249543,0.261564,0.475892,0.462153,0.446089,2.624489,0.684877
min,1.020000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,5.000000,1.000000
25%,3.707500,8.000000,0.000000,1.000000,0.000000,0.000000,0.000000,0.000000,12.000000,3.000000
50%,5.300000,15.000000,0.000000,1.000000,0.000000,0.000000,1.000000,0.000000,12.000000,3.000000
75%,7.695000,27.000000,1.000000,1.000000,0.000000,1.000000,1.000000,1.000000,13.000000,4.000000
max,77.720000,48.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,17.000000,5.000000

In [18]:
data['exper'].head()

0    30
1    28
2    35
3    38
4    27
Name: exper, dtype: int64

In [42]:
 data.loc[0:5, ['wage', 'female']]

    wage  female
0   5.73       1
1   4.28       1
2   7.96       1
3  11.57       0
4  11.42       0
5   3.91       1

In [23]:
data.iloc[:5,2:4]

   union  goodhlth
0      0         1
1      0         1
2      0         1
3      0         1
4      0         1

In [26]:
data[data['female']==1]['wage'].mean(), \
data[data['female']==0]['wage'].mean()

(4.299357798165137, 7.3688228155339806)

In [40]:
data[(data['female']==0) & (data['married'] == 1)]['wage'].median(), \
data[(data['female']==0) & (data['married'] == 0)]['wage'].median()

(6.710000000000001, 5.0649999999999995)

In [46]:
help(pd.groupby)

Help on function groupby in module pandas.core.api:

groupby(*args, **kwargs)

In [51]:
for look, sub_df in data.groupby(['looks', 'female']):
   print(look)
   print(sub_df.head())

(1, 0)
      wage  exper  union  goodhlth  black  female  married  service  educ  \
28    8.35     41      0         0      0       0        1        1    16
200   3.75     36      0         1      0       0        0        0    12
248  10.99     40      0         1      0       0        1        0    12
751   7.93     39      1         1      0       0        1        0    12
837   5.56     10      0         1      0       0        1        0    13

     looks
28       1
200      1
248      1
751      1
837      1
(1, 1)
      wage  exper  union  goodhlth  black  female  married  service  educ  \
327   1.65     24      0         1      0       1        0        1    13
1126  3.46     26      0         1      0       1        0        1     5
1149  1.26     32      0         1      1       1        0        0     5
1171  2.25     12      0         1      1       1        0        0     5
1213  2.15      6      0         1      0       1        1        1    12

      looks
327       1
1126      1
1149      1
1171      1
1213      1
(2, 0)
    wage  exper  union  goodhlth  black  female  married  service  educ  looks
12  5.14     19      0         1      0       0        1        1    17      2
33  8.17     18      0         1      0       0        1        0    16      2
35  9.62     37      0         1      0       0        1        0    13      2
37  7.69     10      1         1      0       0        1        0    13      2
57  6.56     17      0         1      0       0        1        0    13      2
(2, 1)
     wage  exper  union  goodhlth  black  female  married  service  educ  \
65   7.14     20      0         1      0       1        0        1    17
79   5.73     12      0         1      0       1        0        1    13
94   6.73     25      0         1      0       1        1        1    13
96   4.35      8      0         1      0       1        1        1    14
118  4.37     19      0         1      0       1        0        1    17

     looks
65       2
79       2
94       2
96       2
118      2
(3, 0)
     wage  exper  union  goodhlth  black  female  married  service  educ  \
3   11.57     38      0         1      0       0        1        1    16
4   11.42     27      0         1      0       0        1        0    16
6    8.76     12      0         1      0       0        1        0    16
13   3.00      8      0         1      0       0        0        1    16
16   5.16      7      0         1      0       0        1        0    17

    looks
3       3
4       3
6       3
13      3
16      3
(3, 1)
    wage  exper  union  goodhlth  black  female  married  service  educ  looks
1   4.28     28      0         1      0       1        1        0    12      3
5   3.91     20      0         0      0       1        1        0    12      3
8   5.00      5      0         1      0       1        0        0    16      3
9   3.89     12      0         1      0       1        0        0    12      3
19  7.69      7      0         1      0       1        1        1    16      3
(4, 0)
     wage  exper  union  goodhlth  black  female  married  service  educ  \
7    7.69      5      1         1      0       0        0        0    16
11   4.03      6      0         1      0       0        1        0    16
14   7.99     12      0         1      0       0        1        0    16
15   6.01     17      0         1      0       0        1        0    16
17  11.54     12      0         1      0       0        1        1    17

    looks
7       4
11      4
14      4
15      4
17      4
(4, 1)
     wage  exper  union  goodhlth  black  female  married  service  educ  \
0    5.73     30      0         1      0       1        1        1    14
2    7.96     35      0         1      0       1        0        0    10
10   3.45      3      0         1      0       1        0        0    12
18  10.44     10      0         1      0       1        0        0    17
50   9.16     19      1         1      0       1        1        1    17

    looks
0       4
2       4
10      4
18      4
50      4
(5, 0)
      wage  exper  union  goodhlth  black  female  married  service  educ  \
26   14.84     29      0         1      0       0        0        1    13
27   19.08     17      0         1      0       0        0        0    17
76   23.32     15      0         1      0       0        1        1    17
316   3.92     12      0         1      0       0        1        1    12
363  10.66      8      0         1      0       0        0        0    13

     looks
26       5
27       5
76       5
316      5
363      5
(5, 1)
     wage  exper  union  goodhlth  black  female  married  service  educ  \
112  6.11      7      0         1      0       1        1        0    12
492  2.51      4      0         1      0       1        0        0    12
506  4.40      3      0         1      0       1        0        0    13
512  5.09      7      0         1      0       1        0        0    17
562  4.95     10      0         1      1       1        0        0    14

     looks
112      5
492      5
506      5
512      5
562      5

In [55]:
data.groupby('looks')[['wage', 'exper']].agg(np.median)

        wage  exper
looks
1      3.460   32.0
2      4.595   18.0
3      5.635   18.0
4      5.240   12.5
5      4.810    8.0

In [57]:
#How gender related to married?
pd.crosstab(data['female'], data['looks'])

looks   1   2    3    4   5
female
0       8  88  489  228  11
1       5  54  233  136   8

In [66]:
data['is_reach'] = (data['wage'] > data['wage'].quantile(.75)).astype('int64')
data['is_reach'].head()

0    0
1    0
2    1
3    1
4    1
Name: is_reach, dtype: int64

In [68]:
data.apply(np.mean)

wage         6.306690
exper       18.206349
union        0.272222
goodhlth     0.933333
black        0.073810
female       0.346032
married      0.691270
service      0.273810
educ        12.563492
looks        3.185714
is_reach     0.250000
dtype: float64

In [70]:
data['female'].apply(lambda female: 'female' if female else 'male').head()

0    female
1    female
2    female
3      male
4      male
Name: female, dtype: object